torbrodtkorb/alva-master/firmware/pack/edc/AVR32DB32.PIC
<?xml version='1.0' encoding='UTF-8' standalone='no'?>
<edc:PIC xmlns:atdf="http://crownking/atdf" xmlns:edc="http://crownking/edc" xmlns:ltx="http://crownking/ltx" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://crownking/edc edc/PIC.xsd" edc:name="AVR32DB32" edc:arch="avr8" edc:procid="0x0000" atdf:architecture="AVR8X" atdf:family="AVR" edc:hasFreeze="false">
  <edc:Properties>
    <edc:Property edc:propkey="file.registers.are.odd.address.accessible" edc:propvalue="true"/>
  </edc:Properties>
  <edc:Power>
    <edc:VDD edc:minvoltage="1.8" edc:maxvoltage="5.5" edc:nominalvoltage="5.000"/>
  </edc:Power>
  <edc:Programming edc:haslvp2="true" edc:haschecksum="false">
    <edc:ProgrammingRowSize edc:progop="cfg" edc:nzsize="1"/>
    <edc:ProgrammingRowSize edc:progop="eedata" edc:nzsize="1"/>
    <edc:ProgrammingRowSize edc:progop="pgm" edc:nzsize="512"/>
  </edc:Programming>
  <edc:ArchDef edc:name="avr8" edc:desc="avr8">
    <edc:MemTraits>
      <edc:ProgramMemTraits edc:addrinc="0x1" edc:locsize="0x2" edc:wordimpl="0xFFFF" edc:wordinit="0xFFFF" edc:wordsafe="0xFFFF" edc:wordsize="0xFFFF"/>
      <edc:DataMemTraits edc:addrinc="0x1" edc:locsize="0x1" edc:wordimpl="0xFF" edc:wordinit="0xFF" edc:wordsafe="0xFF" edc:wordsize="0x1"/>
      <edc:EEDataMemTraits edc:magicoffset="0x810000"/>
    </edc:MemTraits>
  </edc:ArchDef>
  <edc:InstructionSet edc:instructionsetid="avr8">
    <edc:InstructionSet edc:instructionsetid="avr8base"/>
    <edc:InstructionSet edc:instructionsetid="avr8brk"/>
    <edc:InstructionSet edc:instructionsetid="avr8elpm"/>
    <edc:InstructionSet edc:instructionsetid="avr8movw"/>
    <edc:InstructionSet edc:instructionsetid="avr8des"/>
    <edc:InstructionSet edc:instructionsetid="avr8lpm"/>
    <edc:InstructionSet edc:instructionsetid="avr8lpmx"/>
    <edc:InstructionSet edc:instructionsetid="avr8mega"/>
    <edc:InstructionSet edc:instructionsetid="avr8sram"/>
    <edc:InstructionSet edc:instructionsetid="avr8spmx"/>
    <edc:InstructionSet edc:instructionsetid="avr8mul"/>
    <edc:InstructionSet edc:instructionsetid="avr8spm"/>
    <edc:InstructionSet edc:instructionsetid="avr8eind"/>
    <edc:InstructionSet edc:instructionsetid="avr8elpmx"/>
  </edc:InstructionSet>
  <edc:InterruptList>
    <edc:Interrupt edc:irq="1" edc:cname="NMI" edc:desc="" ltx:memberofperipheral="CRCSCAN"/>
    <edc:Interrupt edc:irq="2" edc:cname="VLM" edc:desc="" ltx:memberofperipheral="BOD"/>
    <edc:Interrupt edc:irq="3" edc:cname="CFD" edc:desc="" ltx:memberofperipheral="CLKCTRL"/>
    <edc:Interrupt edc:irq="4" edc:cname="MVIO" edc:desc="" ltx:memberofperipheral="MVIO"/>
    <edc:Interrupt edc:irq="5" edc:cname="CNT" edc:desc="" ltx:memberofperipheral="RTC"/>
    <edc:Interrupt edc:irq="6" edc:cname="PIT" edc:desc="" ltx:memberofperipheral="RTC"/>
    <edc:Interrupt edc:irq="7" edc:cname="CCL" edc:desc="" ltx:memberofperipheral="CCL"/>
    <edc:Interrupt edc:irq="8" edc:cname="PORT" edc:desc="" ltx:memberofperipheral="PORTA"/>
    <edc:Interrupt edc:irq="9" edc:cname="LUNF" edc:desc="" ltx:memberofperipheral="TCA0"/>
    <edc:Interrupt edc:irq="9" edc:cname="OVF" edc:desc="" ltx:memberofperipheral="TCA0"/>
    <edc:Interrupt edc:irq="10" edc:cname="HUNF" edc:desc="" ltx:memberofperipheral="TCA0"/>
    <edc:Interrupt edc:irq="11" edc:cname="CMP0" edc:desc="" ltx:memberofperipheral="TCA0"/>
    <edc:Interrupt edc:irq="11" edc:cname="LCMP0" edc:desc="" ltx:memberofperipheral="TCA0"/>
    <edc:Interrupt edc:irq="12" edc:cname="CMP1" edc:desc="" ltx:memberofperipheral="TCA0"/>
    <edc:Interrupt edc:irq="12" edc:cname="LCMP1" edc:desc="" ltx:memberofperipheral="TCA0"/>
    <edc:Interrupt edc:irq="13" edc:cname="CMP2" edc:desc="" ltx:memberofperipheral="TCA0"/>
    <edc:Interrupt edc:irq="13" edc:cname="LCMP2" edc:desc="" ltx:memberofperipheral="TCA0"/>
    <edc:Interrupt edc:irq="14" edc:cname="INT" edc:desc="" ltx:memberofperipheral="TCB0"/>
    <edc:Interrupt edc:irq="15" edc:cname="INT" edc:desc="" ltx:memberofperipheral="TCB1"/>
    <edc:Interrupt edc:irq="16" edc:cname="OVF" edc:desc="" ltx:memberofperipheral="TCD0"/>
    <edc:Interrupt edc:irq="17" edc:cname="TRIG" edc:desc="" ltx:memberofperipheral="TCD0"/>
    <edc:Interrupt edc:irq="18" edc:cname="TWIS" edc:desc="" ltx:memberofperipheral="TWI0"/>
    <edc:Interrupt edc:irq="19" edc:cname="TWIM" edc:desc="" ltx:memberofperipheral="TWI0"/>
    <edc:Interrupt edc:irq="20" edc:cname="INT" edc:desc="" ltx:memberofperipheral="SPI0"/>
    <edc:Interrupt edc:irq="21" edc:cname="RXC" edc:desc="" ltx:memberofperipheral="USART0"/>
    <edc:Interrupt edc:irq="22" edc:cname="DRE" edc:desc="" ltx:memberofperipheral="USART0"/>
    <edc:Interrupt edc:irq="23" edc:cname="TXC" edc:desc="" ltx:memberofperipheral="USART0"/>
    <edc:Interrupt edc:irq="24" edc:cname="PORT" edc:desc="" ltx:memberofperipheral="PORTD"/>
    <edc:Interrupt edc:irq="25" edc:cname="AC" edc:desc="" ltx:memberofperipheral="AC0"/>
    <edc:Interrupt edc:irq="26" edc:cname="RESRDY" edc:desc="" ltx:memberofperipheral="ADC0"/>
    <edc:Interrupt edc:irq="27" edc:cname="WCMP" edc:desc="" ltx:memberofperipheral="ADC0"/>
    <edc:Interrupt edc:irq="28" edc:cname="ZCD" edc:desc="" ltx:memberofperipheral="ZCD0"/>
    <edc:Interrupt edc:irq="29" edc:cname="AC" edc:desc="" ltx:memberofperipheral="AC1"/>
    <edc:Interrupt edc:irq="30" edc:cname="PORT" edc:desc="" ltx:memberofperipheral="PORTC"/>
    <edc:Interrupt edc:irq="31" edc:cname="INT" edc:desc="" ltx:memberofperipheral="TCB2"/>
    <edc:Interrupt edc:irq="32" edc:cname="RXC" edc:desc="" ltx:memberofperipheral="USART1"/>
    <edc:Interrupt edc:irq="33" edc:cname="DRE" edc:desc="" ltx:memberofperipheral="USART1"/>
    <edc:Interrupt edc:irq="34" edc:cname="TXC" edc:desc="" ltx:memberofperipheral="USART1"/>
    <edc:Interrupt edc:irq="35" edc:cname="PORT" edc:desc="" ltx:memberofperipheral="PORTF"/>
    <edc:Interrupt edc:irq="36" edc:cname="EE" edc:desc="" ltx:memberofperipheral="NVMCTRL"/>
    <edc:Interrupt edc:irq="37" edc:cname="INT" edc:desc="" ltx:memberofperipheral="SPI1"/>
    <edc:Interrupt edc:irq="38" edc:cname="RXC" edc:desc="" ltx:memberofperipheral="USART2"/>
    <edc:Interrupt edc:irq="39" edc:cname="DRE" edc:desc="" ltx:memberofperipheral="USART2"/>
    <edc:Interrupt edc:irq="40" edc:cname="TXC" edc:desc="" ltx:memberofperipheral="USART2"/>
    <edc:Interrupt edc:irq="41" edc:cname="AC" edc:desc="" ltx:memberofperipheral="AC2"/>
    <edc:Interrupt edc:irq="42" edc:cname="TWIS" edc:desc="" ltx:memberofperipheral="TWI1"/>
    <edc:Interrupt edc:irq="43" edc:cname="TWIM" edc:desc="" ltx:memberofperipheral="TWI1"/>
  </edc:InterruptList>
  <edc:PeripheralList>
    <edc:Peripheral edc:cname="AC0" edc:desc=""/>
    <edc:Peripheral edc:cname="AC1" edc:desc=""/>
    <edc:Peripheral edc:cname="AC2" edc:desc=""/>
    <edc:Peripheral edc:cname="ADC0" edc:desc=""/>
    <edc:Peripheral edc:cname="BOD" edc:desc=""/>
    <edc:Peripheral edc:cname="CCL" edc:desc=""/>
    <edc:Peripheral edc:cname="CLKCTRL" edc:desc=""/>
    <edc:Peripheral edc:cname="CPU" edc:desc=""/>
    <edc:Peripheral edc:cname="CPUINT" edc:desc=""/>
    <edc:Peripheral edc:cname="CRCSCAN" edc:desc=""/>
    <edc:Peripheral edc:cname="DAC0" edc:desc=""/>
    <edc:Peripheral edc:cname="EVSYS" edc:desc=""/>
    <edc:Peripheral edc:cname="FUSE" edc:desc=""/>
    <edc:Peripheral edc:cname="GPR" edc:desc=""/>
    <edc:Peripheral edc:cname="LOCK" edc:desc=""/>
    <edc:Peripheral edc:cname="MVIO" edc:desc=""/>
    <edc:Peripheral edc:cname="NVMCTRL" edc:desc=""/>
    <edc:Peripheral edc:cname="OPAMP" edc:desc=""/>
    <edc:Peripheral edc:cname="PORTA" edc:desc=""/>
    <edc:Peripheral edc:cname="PORTC" edc:desc=""/>
    <edc:Peripheral edc:cname="PORTD" edc:desc=""/>
    <edc:Peripheral edc:cname="PORTF" edc:desc=""/>
    <edc:Peripheral edc:cname="PORTMUX" edc:desc=""/>
    <edc:Peripheral edc:cname="RSTCTRL" edc:desc=""/>
    <edc:Peripheral edc:cname="RTC" edc:desc=""/>
    <edc:Peripheral edc:cname="SIGROW" edc:desc=""/>
    <edc:Peripheral edc:cname="SLPCTRL" edc:desc=""/>
    <edc:Peripheral edc:cname="SPI0" edc:desc=""/>
    <edc:Peripheral edc:cname="SPI1" edc:desc=""/>
    <edc:Peripheral edc:cname="SYSCFG" edc:desc=""/>
    <edc:Peripheral edc:cname="TCA0" edc:desc=""/>
    <edc:Peripheral edc:cname="TCB0" edc:desc=""/>
    <edc:Peripheral edc:cname="TCB1" edc:desc=""/>
    <edc:Peripheral edc:cname="TCB2" edc:desc=""/>
    <edc:Peripheral edc:cname="TCD0" edc:desc=""/>
    <edc:Peripheral edc:cname="TWI0" edc:desc=""/>
    <edc:Peripheral edc:cname="TWI1" edc:desc=""/>
    <edc:Peripheral edc:cname="USART0" edc:desc=""/>
    <edc:Peripheral edc:cname="USART1" edc:desc=""/>
    <edc:Peripheral edc:cname="USART2" edc:desc=""/>
    <edc:Peripheral edc:cname="USERROW" edc:desc=""/>
    <edc:Peripheral edc:cname="VPORTA" edc:desc=""/>
    <edc:Peripheral edc:cname="VPORTC" edc:desc=""/>
    <edc:Peripheral edc:cname="VPORTD" edc:desc=""/>
    <edc:Peripheral edc:cname="VPORTF" edc:desc=""/>
    <edc:Peripheral edc:cname="VREF" edc:desc=""/>
    <edc:Peripheral edc:cname="WDT" edc:desc=""/>
    <edc:Peripheral edc:cname="ZCD0" edc:desc=""/>
  </edc:PeripheralList>
  <edc:ProgramSpace>
    <edc:CodeSector edc:regionid="PROGMEM" edc:beginaddr="0x0" edc:endaddr="0x4000" atdf:pagesize="0x200" edc:rw="rw"/>
  </edc:ProgramSpace>
  <edc:DataSpace edc:magicoffset="0x800000">
    <edc:RegardlessOfMode>
      <edc:NMMRPlace edc:regionid="corenmmrs">
        <edc:SFRDef edc:nzwidth="0x10" edc:cname="PC" edc:impl="0xFFFF" edc:access="nnnnnnnnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:desc="Program Counter" edc:nmmrid="60"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R0" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="0"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R1" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="1"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R2" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="2"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R3" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="3"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R4" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="4"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R5" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="5"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R6" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="6"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R7" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="7"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R8" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="8"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R9" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="9"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R10" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="10"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R11" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="11"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R12" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="12"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R13" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="13"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R14" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="14"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R15" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="15"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R16" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="16"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R17" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="17"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R18" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="18"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R19" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="19"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R20" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="20"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R21" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="21"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R22" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="22"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R23" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="23"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R24" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="24"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R25" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="25"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R26" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="26"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R27" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="27"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R28" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="28"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R29" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="29"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R30" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="30"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R31" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="31"/>
      </edc:NMMRPlace>
      <edc:SFRDataSector edc:regionid="IO" edc:beginaddr="0x0" edc:endaddr="0x100C" edc:rw="rw">
        <edc:SFRDef ltx:memberofperipheral="VPORTA" edc:cname="DIR" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x0"/>
        <edc:SFRDef ltx:memberofperipheral="VPORTA" edc:cname="OUT" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1"/>
        <edc:SFRDef ltx:memberofperipheral="VPORTA" edc:cname="IN" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x2"/>
        <edc:SFRDef ltx:memberofperipheral="VPORTA" edc:cname="INTFLAGS" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:_addr="0x3">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="VPORTA">
              <edc:SFRFieldDef edc:cname="INT" edc:nzwidth="0x8" edc:desc="Pin Interrupt Flag"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
