torbrodtkorb/alva-master/firmware/pack/edc/AVR32DB32.PIC
        <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x4"/>
        <edc:SFRDef ltx:memberofperipheral="VPORTC" edc:cname="DIR" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x8"/>
        <edc:SFRDef ltx:memberofperipheral="VPORTC" edc:cname="OUT" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x9"/>
        <edc:SFRDef ltx:memberofperipheral="VPORTC" edc:cname="IN" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0xA"/>
        <edc:SFRDef ltx:memberofperipheral="VPORTC" edc:cname="INTFLAGS" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:_addr="0xB">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="VPORTC">
              <edc:SFRFieldDef edc:cname="INT" edc:nzwidth="0x8" edc:desc="Pin Interrupt Flag"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="VPORTD" edc:cname="DIR" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0xC"/>
        <edc:SFRDef ltx:memberofperipheral="VPORTD" edc:cname="OUT" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0xD"/>
        <edc:SFRDef ltx:memberofperipheral="VPORTD" edc:cname="IN" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0xE"/>
        <edc:SFRDef ltx:memberofperipheral="VPORTD" edc:cname="INTFLAGS" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:_addr="0xF">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="VPORTD">
              <edc:SFRFieldDef edc:cname="INT" edc:nzwidth="0x8" edc:desc="Pin Interrupt Flag"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x10"/>
        <edc:SFRDef ltx:memberofperipheral="VPORTF" edc:cname="DIR" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x14"/>
        <edc:SFRDef ltx:memberofperipheral="VPORTF" edc:cname="OUT" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x15"/>
        <edc:SFRDef ltx:memberofperipheral="VPORTF" edc:cname="IN" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x16"/>
        <edc:SFRDef ltx:memberofperipheral="VPORTF" edc:cname="INTFLAGS" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:_addr="0x17">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="VPORTF">
              <edc:SFRFieldDef edc:cname="INT" edc:nzwidth="0x8" edc:desc="Pin Interrupt Flag"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x18"/>
        <edc:SFRDef ltx:memberofperipheral="GPR" edc:cname="GPR0" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1C"/>
        <edc:SFRDef ltx:memberofperipheral="GPR" edc:cname="GPR1" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1D"/>
        <edc:SFRDef ltx:memberofperipheral="GPR" edc:cname="GPR2" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1E"/>
        <edc:SFRDef ltx:memberofperipheral="GPR" edc:cname="GPR3" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x1F"/>
        <edc:AdjustPoint edc:offset="0x14" edc:_addr="0x20"/>
        <edc:SFRDef ltx:memberofperipheral="CPU" edc:cname="CCP" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:_addr="0x34">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CPU">
              <edc:SFRFieldDef edc:cname="CCP" edc:nzwidth="0x8" edc:desc="CCP signature">
                <edc:SFRFieldSemantic edc:cname="SPM" edc:desc="SPM Instruction Protection" edc:when="(field &amp; 0xFF) == 0x9D"/>
                <edc:SFRFieldSemantic edc:cname="IOREG" edc:desc="IO Register Protection" edc:when="(field &amp; 0xFF) == 0xD8"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x6" edc:_addr="0x35"/>
        <edc:SFRDef ltx:memberofperipheral="CPU" edc:cname="RAMPZ" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:_addr="0x3B"/>
        <edc:AdjustPoint edc:offset="0x1" edc:_addr="0x3C"/>
        <edc:SFRDef ltx:memberofperipheral="CPU" edc:cname="SP" edc:nzwidth="0x10" edc:access="nnnnnnnnnnnnnnnn" edc:por="0111111111111111" edc:mclr="0111111111111111" edc:_addr="0x3D"/>
        <edc:SFRDef ltx:memberofperipheral="CPU" edc:cname="SREG" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:_addr="0x3F">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CPU">
              <edc:SFRFieldDef edc:cname="C" edc:nzwidth="0x1" edc:desc="Carry Flag"/>
              <edc:SFRFieldDef edc:cname="Z" edc:nzwidth="0x1" edc:desc="Zero Flag"/>
              <edc:SFRFieldDef edc:cname="N" edc:nzwidth="0x1" edc:desc="Negative Flag"/>
              <edc:SFRFieldDef edc:cname="V" edc:nzwidth="0x1" edc:desc="Two's Complement Overflow Flag"/>
              <edc:SFRFieldDef edc:cname="S" edc:nzwidth="0x1" edc:desc="N Exclusive Or V Flag"/>
              <edc:SFRFieldDef edc:cname="H" edc:nzwidth="0x1" edc:desc="Half Carry Flag"/>
              <edc:SFRFieldDef edc:cname="T" edc:nzwidth="0x1" edc:desc="Transfer Bit"/>
              <edc:SFRFieldDef edc:cname="I" edc:nzwidth="0x1" edc:desc="Global Interrupt Enable Flag"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="RSTCTRL" edc:cname="RSTFR" edc:nzwidth="0x8" edc:access="--nnnnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3F" edc:_addr="0x40">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RSTCTRL">
              <edc:SFRFieldDef edc:cname="PORF" edc:nzwidth="0x1" edc:desc="Power on Reset flag"/>
              <edc:SFRFieldDef edc:cname="BORF" edc:nzwidth="0x1" edc:desc="Brown out detector Reset flag"/>
              <edc:SFRFieldDef edc:cname="EXTRF" edc:nzwidth="0x1" edc:desc="External Reset flag"/>
              <edc:SFRFieldDef edc:cname="WDRF" edc:nzwidth="0x1" edc:desc="Watch dog Reset flag"/>
              <edc:SFRFieldDef edc:cname="SWRF" edc:nzwidth="0x1" edc:desc="Software Reset flag"/>
              <edc:SFRFieldDef edc:cname="UPDIRF" edc:nzwidth="0x1" edc:desc="UPDI Reset flag"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="RSTCTRL" edc:cname="SWRR" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x41">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RSTCTRL">
              <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software reset enable"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0xE" edc:_addr="0x42"/>
        <edc:SFRDef ltx:memberofperipheral="SLPCTRL" edc:cname="CTRLA" edc:nzwidth="0x8" edc:access="-----nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7" edc:_addr="0x50">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLPCTRL">
              <edc:SFRFieldDef edc:cname="SEN" edc:nzwidth="0x1" edc:desc="Sleep enable"/>
              <edc:SFRFieldDef edc:cname="SMODE" edc:nzwidth="0x2" edc:desc="Sleep mode">
                <edc:SFRFieldSemantic edc:cname="IDLE" edc:desc="Idle mode" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="STDBY" edc:desc="Standby Mode" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="PDOWN" edc:desc="Power-down Mode" edc:when="(field &amp; 0x3) == 0x02"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="SLPCTRL" edc:cname="VREGCTRL" edc:nzwidth="0x8" edc:access="---n-nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x17" edc:_addr="0x51">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SLPCTRL">
              <edc:SFRFieldDef edc:cname="PMODE" edc:nzwidth="0x3" edc:desc="Performance Mode">
                <edc:SFRFieldSemantic edc:cname="AUTO" edc:desc="" edc:when="(field &amp; 0x7) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="FULL" edc:desc="" edc:when="(field &amp; 0x7) == 0x01"/>
              </edc:SFRFieldDef>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="HTLLEN" edc:nzwidth="0x1" edc:desc="High Temperature Low Leakage Enable">
                <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Disabled" edc:when="(field &amp; 0x1) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="ON" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x01"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0xE" edc:_addr="0x52"/>
        <edc:SFRDef ltx:memberofperipheral="CLKCTRL" edc:cname="MCLKCTRLA" edc:nzwidth="0x8" edc:access="n----nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x87" edc:_addr="0x60">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CLKCTRL">
              <edc:SFRFieldDef edc:cname="CLKSEL" edc:nzwidth="0x3" edc:desc="Clock select">
                <edc:SFRFieldSemantic edc:cname="OSCHF" edc:desc="Internal high-frequency oscillator" edc:when="(field &amp; 0x7) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="OSC32K" edc:desc="Internal 32.768 kHz oscillator" edc:when="(field &amp; 0x7) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="XOSC32K" edc:desc="32.768 kHz crystal oscillator" edc:when="(field &amp; 0x7) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="EXTCLK" edc:desc="External clock" edc:when="(field &amp; 0x7) == 0x03"/>
              </edc:SFRFieldDef>
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="CLKOUT" edc:nzwidth="0x1" edc:desc="System clock out"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="CLKCTRL" edc:cname="MCLKCTRLB" edc:nzwidth="0x8" edc:access="---nnnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1F" edc:_addr="0x61">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CLKCTRL">
              <edc:SFRFieldDef edc:cname="PEN" edc:nzwidth="0x1" edc:desc="Prescaler enable"/>
              <edc:SFRFieldDef edc:cname="PDIV" edc:nzwidth="0x4" edc:desc="Prescaler division">
                <edc:SFRFieldSemantic edc:cname="2X" edc:desc="2X" edc:when="(field &amp; 0xF) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="4X" edc:desc="4X" edc:when="(field &amp; 0xF) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="8X" edc:desc="8X" edc:when="(field &amp; 0xF) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="16X" edc:desc="16X" edc:when="(field &amp; 0xF) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="32X" edc:desc="32X" edc:when="(field &amp; 0xF) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="64X" edc:desc="64X" edc:when="(field &amp; 0xF) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="6X" edc:desc="6X" edc:when="(field &amp; 0xF) == 0x08"/>
                <edc:SFRFieldSemantic edc:cname="10X" edc:desc="10X" edc:when="(field &amp; 0xF) == 0x09"/>
                <edc:SFRFieldSemantic edc:cname="12X" edc:desc="12X" edc:when="(field &amp; 0xF) == 0x0A"/>
                <edc:SFRFieldSemantic edc:cname="24X" edc:desc="24X" edc:when="(field &amp; 0xF) == 0x0B"/>
                <edc:SFRFieldSemantic edc:cname="48X" edc:desc="48X" edc:when="(field &amp; 0xF) == 0x0C"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
