torbrodtkorb/alva-master/firmware/pack/edc/AVR32DB32.PIC
        <edc:SFRDef ltx:memberofperipheral="PORTMUX" edc:cname="TCBROUTEA" edc:nzwidth="0x8" edc:access="-----nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7" edc:_addr="0x5E7">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORTMUX">
              <edc:SFRFieldDef edc:cname="TCB0" edc:nzwidth="0x1" edc:desc="TCB0 Output">
                <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="WO on PA2" edc:when="(field &amp; 0x1) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="ALT1" edc:desc="WO on PF4" edc:when="(field &amp; 0x1) == 0x01"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="TCB1" edc:nzwidth="0x1" edc:desc="TCB1 Output">
                <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="WO on PA3" edc:when="(field &amp; 0x1) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="ALT1" edc:desc="WO on PF5" edc:when="(field &amp; 0x1) == 0x01"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="TCB2" edc:nzwidth="0x1" edc:desc="TCB2 Output">
                <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="WO on PC0" edc:when="(field &amp; 0x1) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="ALT1" edc:desc="WO on PB4" edc:when="(field &amp; 0x1) == 0x01"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="PORTMUX" edc:cname="TCDROUTEA" edc:nzwidth="0x8" edc:access="-----nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7" edc:_addr="0x5E8">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORTMUX">
              <edc:SFRFieldDef edc:cname="TCD0" edc:nzwidth="0x3" edc:desc="TCD0 Signals">
                <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="PA4, PA5, PA6, PA7" edc:when="(field &amp; 0x7) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="ALT1" edc:desc="PB4, PB5, PB6, PB7" edc:when="(field &amp; 0x7) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="ALT2" edc:desc="PF0, PF1, PF2, PF3" edc:when="(field &amp; 0x7) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="ALT3" edc:desc="PG4, PG5, PG6, PG7" edc:when="(field &amp; 0x7) == 0x03"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="PORTMUX" edc:cname="ACROUTEA" edc:nzwidth="0x8" edc:access="-----nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7" edc:_addr="0x5E9">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORTMUX">
              <edc:SFRFieldDef edc:cname="AC0" edc:nzwidth="0x1" edc:desc="Analog Comparator 0 Output">
                <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="OUT on PA7" edc:when="(field &amp; 0x1) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="ALT1" edc:desc="OUT on PC6" edc:when="(field &amp; 0x1) == 0x01"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="AC1" edc:nzwidth="0x1" edc:desc="Analog Comparator 1 Output">
                <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="OUT on PA7" edc:when="(field &amp; 0x1) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="ALT1" edc:desc="OUT on PC6" edc:when="(field &amp; 0x1) == 0x01"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="AC2" edc:nzwidth="0x1" edc:desc="Analog Comparator 2 Output">
                <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="OUT on PA7" edc:when="(field &amp; 0x1) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="ALT1" edc:desc="OUT on PC6" edc:when="(field &amp; 0x1) == 0x01"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="PORTMUX" edc:cname="ZCDROUTEA" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x5EA">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORTMUX">
              <edc:SFRFieldDef edc:cname="ZCD0" edc:nzwidth="0x1" edc:desc="Zero Cross Detector 0 Output">
                <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="OUT on PA7" edc:when="(field &amp; 0x1) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="ALT1" edc:desc="OUT on PC7" edc:when="(field &amp; 0x1) == 0x01"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x15" edc:_addr="0x5EB"/>
        <edc:SFRDef ltx:memberofperipheral="ADC0" edc:cname="CTRLA" edc:nzwidth="0x8" edc:access="n-nnnnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0xBF" edc:_addr="0x600">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC0">
              <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="ADC Enable"/>
              <edc:SFRFieldDef edc:cname="FREERUN" edc:nzwidth="0x1" edc:desc="Free running mode"/>
              <edc:SFRFieldDef edc:cname="RESSEL" edc:nzwidth="0x2" edc:desc="Resolution selection">
                <edc:SFRFieldSemantic edc:cname="12BIT" edc:desc="12-bit mode" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="10BIT" edc:desc="10-bit mode" edc:when="(field &amp; 0x3) == 0x01"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="LEFTADJ" edc:nzwidth="0x1" edc:desc="Left adjust result"/>
              <edc:SFRFieldDef edc:cname="CONVMODE" edc:nzwidth="0x1" edc:desc="Conversion mode">
                <edc:SFRFieldSemantic edc:cname="SINGLEENDED" edc:desc="Single-Ended mode" edc:when="(field &amp; 0x1) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="DIFF" edc:desc="Differential mode" edc:when="(field &amp; 0x1) == 0x01"/>
              </edc:SFRFieldDef>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="RUNSTBY" edc:nzwidth="0x1" edc:desc="Run standby mode"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="ADC0" edc:cname="CTRLB" edc:nzwidth="0x8" edc:access="-----nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7" edc:_addr="0x601">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC0">
              <edc:SFRFieldDef edc:cname="SAMPNUM" edc:nzwidth="0x3" edc:desc="Accumulation Samples">
                <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No accumulation" edc:when="(field &amp; 0x7) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="ACC2" edc:desc="2 results accumulated" edc:when="(field &amp; 0x7) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="ACC4" edc:desc="4 results accumulated" edc:when="(field &amp; 0x7) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="ACC8" edc:desc="8 results accumulated" edc:when="(field &amp; 0x7) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="ACC16" edc:desc="16 results accumulated" edc:when="(field &amp; 0x7) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="ACC32" edc:desc="32 results accumulated" edc:when="(field &amp; 0x7) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="ACC64" edc:desc="64 results accumulated" edc:when="(field &amp; 0x7) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="ACC128" edc:desc="128 results accumulated" edc:when="(field &amp; 0x7) == 0x07"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
