torbrodtkorb/alva-master/firmware/pack/edc/AVR32DB32.PIC
        <edc:SFRDef ltx:memberofperipheral="USART2" edc:cname="EVCTRL" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x84C">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
              <edc:SFRFieldDef edc:cname="IREI" edc:nzwidth="0x1" edc:desc="IrDA Event Input Enable"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="USART2" edc:cname="TXPLCTRL" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:_addr="0x84D">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
              <edc:SFRFieldDef edc:cname="TXPL" edc:nzwidth="0x8" edc:desc="Transmit pulse length"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="USART2" edc:cname="RXPLCTRL" edc:nzwidth="0x8" edc:access="-nnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7F" edc:_addr="0x84E">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
              <edc:SFRFieldDef edc:cname="RXPL" edc:nzwidth="0x7" edc:desc="Receiver Pulse Lenght"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0xB1" edc:_addr="0x84F"/>
        <edc:SFRDef ltx:memberofperipheral="TWI0" edc:cname="CTRLA" edc:nzwidth="0x8" edc:access="-n-nnnn-" edc:por="00000000" edc:mclr="00000000" edc:impl="0x5E" edc:_addr="0x900">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="FMPEN" edc:nzwidth="0x1" edc:desc="FM Plus Enable">
                <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Operating in Standard-mode or Fast-mode" edc:when="(field &amp; 0x1) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="ON" edc:desc="Operating in Fast-mode Plus" edc:when="(field &amp; 0x1) == 0x01"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="SDAHOLD" edc:nzwidth="0x2" edc:desc="SDA Hold Time">
                <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="SDA hold time off" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="50NS" edc:desc="Typical 50ns hold time" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="300NS" edc:desc="Typical 300ns hold time" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="500NS" edc:desc="Typical 500ns hold time" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="SDASETUP" edc:nzwidth="0x1" edc:desc="SDA Setup Time">
                <edc:SFRFieldSemantic edc:cname="4CYC" edc:desc="SDA setup time is 4 clock cycles" edc:when="(field &amp; 0x1) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="8CYC" edc:desc="SDA setup time is 8 clock cycles" edc:when="(field &amp; 0x1) == 0x01"/>
              </edc:SFRFieldDef>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="INPUTLVL" edc:nzwidth="0x1" edc:desc="Input Voltage Transition Level">
                <edc:SFRFieldSemantic edc:cname="I2C" edc:desc="I2C input voltage transition level" edc:when="(field &amp; 0x1) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="SMBUS" edc:desc="SMBus 3.0 input voltage transition level" edc:when="(field &amp; 0x1) == 0x01"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="TWI0" edc:cname="DUALCTRL" edc:nzwidth="0x8" edc:access="-n--nnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x4F" edc:_addr="0x901">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI0">
              <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Dual Control Enable"/>
              <edc:SFRFieldDef edc:cname="FMPEN" edc:nzwidth="0x1" edc:desc="FM Plus Enable"/>
              <edc:SFRFieldDef edc:cname="SDAHOLD" edc:nzwidth="0x2" edc:desc="SDA Hold Time">
                <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="SDA hold time off" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="50NS" edc:desc="Typical 50ns hold time" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="300NS" edc:desc="Typical 300ns hold time" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="500NS" edc:desc="Typical 500ns hold time" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="INPUTLVL" edc:nzwidth="0x1" edc:desc="Input Voltage Transition Level">
                <edc:SFRFieldSemantic edc:cname="I2C" edc:desc="I2C input voltage transition level" edc:when="(field &amp; 0x1) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="SMBUS" edc:desc="SMBus 3.0 input voltage transition level" edc:when="(field &amp; 0x1) == 0x01"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="TWI0" edc:cname="DBGCTRL" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x902">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI0">
              <edc:SFRFieldDef edc:cname="DBGRUN" edc:nzwidth="0x1" edc:desc="Debug Run"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="TWI0" edc:cname="MCTRLA" edc:nzwidth="0x8" edc:access="nn-nnnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0xDF" edc:_addr="0x903">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI0">
              <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable TWI Host"/>
              <edc:SFRFieldDef edc:cname="SMEN" edc:nzwidth="0x1" edc:desc="Smart Mode Enable"/>
              <edc:SFRFieldDef edc:cname="TIMEOUT" edc:nzwidth="0x2" edc:desc="Inactive Bus Timeout">
                <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Bus Timeout Disabled" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="50US" edc:desc="50 Microseconds" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="100US" edc:desc="100 Microseconds" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="200US" edc:desc="200 Microseconds" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="QCEN" edc:nzwidth="0x1" edc:desc="Quick Command Enable"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="WIEN" edc:nzwidth="0x1" edc:desc="Write Interrupt Enable"/>
              <edc:SFRFieldDef edc:cname="RIEN" edc:nzwidth="0x1" edc:desc="Read Interrupt Enable"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="TWI0" edc:cname="MCTRLB" edc:nzwidth="0x8" edc:access="----nnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0xF" edc:_addr="0x904">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI0">
              <edc:SFRFieldDef edc:cname="MCMD" edc:nzwidth="0x2" edc:desc="Command">
                <edc:SFRFieldSemantic edc:cname="NOACT" edc:desc="No Action" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="REPSTART" edc:desc="Issue Repeated Start Condition" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="RECVTRANS" edc:desc="Receive or Transmit Data, depending on DIR" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="STOP" edc:desc="Issue Stop Condition" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="ACKACT" edc:nzwidth="0x1" edc:desc="Acknowledge Action">
                <edc:SFRFieldSemantic edc:cname="ACK" edc:desc="Send ACK" edc:when="(field &amp; 0x1) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="NACK" edc:desc="Send NACK" edc:when="(field &amp; 0x1) == 0x01"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="FLUSH" edc:nzwidth="0x1" edc:desc="Flush"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="TWI0" edc:cname="MSTATUS" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:_addr="0x905">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI0">
              <edc:SFRFieldDef edc:cname="BUSSTATE" edc:nzwidth="0x2" edc:desc="Bus State">
                <edc:SFRFieldSemantic edc:cname="UNKNOWN" edc:desc="Unknown Bus State" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="IDLE" edc:desc="Bus is Idle" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="OWNER" edc:desc="This Module Controls The Bus" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="BUSY" edc:desc="The Bus is Busy" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="BUSERR" edc:nzwidth="0x1" edc:desc="Bus Error"/>
              <edc:SFRFieldDef edc:cname="ARBLOST" edc:nzwidth="0x1" edc:desc="Arbitration Lost"/>
              <edc:SFRFieldDef edc:cname="RXACK" edc:nzwidth="0x1" edc:desc="Received Acknowledge"/>
              <edc:SFRFieldDef edc:cname="CLKHOLD" edc:nzwidth="0x1" edc:desc="Clock Hold"/>
              <edc:SFRFieldDef edc:cname="WIF" edc:nzwidth="0x1" edc:desc="Write Interrupt Flag"/>
              <edc:SFRFieldDef edc:cname="RIF" edc:nzwidth="0x1" edc:desc="Read Interrupt Flag"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="TWI0" edc:cname="MBAUD" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x906"/>
        <edc:SFRDef ltx:memberofperipheral="TWI0" edc:cname="MADDR" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x907"/>
        <edc:SFRDef ltx:memberofperipheral="TWI0" edc:cname="MDATA" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x908"/>
        <edc:SFRDef ltx:memberofperipheral="TWI0" edc:cname="SCTRLA" edc:nzwidth="0x8" edc:access="nnn--nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0xE7" edc:_addr="0x909">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI0">
              <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable TWI Client"/>
              <edc:SFRFieldDef edc:cname="SMEN" edc:nzwidth="0x1" edc:desc="Smart Mode Enable"/>
              <edc:SFRFieldDef edc:cname="PMEN" edc:nzwidth="0x1" edc:desc="Promiscuous Mode Enable"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="PIEN" edc:nzwidth="0x1" edc:desc="Stop Interrupt Enable"/>
              <edc:SFRFieldDef edc:cname="APIEN" edc:nzwidth="0x1" edc:desc="Address/Stop Interrupt Enable"/>
              <edc:SFRFieldDef edc:cname="DIEN" edc:nzwidth="0x1" edc:desc="Data Interrupt Enable"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="TWI0" edc:cname="SCTRLB" edc:nzwidth="0x8" edc:access="-----nnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7" edc:_addr="0x90A">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI0">
              <edc:SFRFieldDef edc:cname="SCMD" edc:nzwidth="0x2" edc:desc="Command">
                <edc:SFRFieldSemantic edc:cname="NOACT" edc:desc="No Action" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="COMPTRANS" edc:desc="Used To Complete a Transaction" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="RESPONSE" edc:desc="Used in Response to Address/Data Interrupt" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="ACKACT" edc:nzwidth="0x1" edc:desc="Acknowledge Action">
                <edc:SFRFieldSemantic edc:cname="ACK" edc:desc="Send ACK" edc:when="(field &amp; 0x1) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="NACK" edc:desc="Send NACK" edc:when="(field &amp; 0x1) == 0x01"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="TWI0" edc:cname="SSTATUS" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:_addr="0x90B">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI0">
              <edc:SFRFieldDef edc:cname="AP" edc:nzwidth="0x1" edc:desc="Client Address or Stop">
                <edc:SFRFieldSemantic edc:cname="STOP" edc:desc="Stop condition generated APIF" edc:when="(field &amp; 0x1) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="ADR" edc:desc="Address detection generated APIF" edc:when="(field &amp; 0x1) == 0x01"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="DIR" edc:nzwidth="0x1" edc:desc="Read/Write Direction"/>
              <edc:SFRFieldDef edc:cname="BUSERR" edc:nzwidth="0x1" edc:desc="Bus Error"/>
              <edc:SFRFieldDef edc:cname="COLL" edc:nzwidth="0x1" edc:desc="Collision"/>
              <edc:SFRFieldDef edc:cname="RXACK" edc:nzwidth="0x1" edc:desc="Received Acknowledge"/>
              <edc:SFRFieldDef edc:cname="CLKHOLD" edc:nzwidth="0x1" edc:desc="Clock Hold"/>
              <edc:SFRFieldDef edc:cname="APIF" edc:nzwidth="0x1" edc:desc="Address/Stop Interrupt Flag"/>
              <edc:SFRFieldDef edc:cname="DIF" edc:nzwidth="0x1" edc:desc="Data Interrupt Flag"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="TWI0" edc:cname="SADDR" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x90C"/>
        <edc:SFRDef ltx:memberofperipheral="TWI0" edc:cname="SDATA" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x90D"/>
        <edc:SFRDef ltx:memberofperipheral="TWI0" edc:cname="SADDRMASK" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x90E">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI0">
              <edc:SFRFieldDef edc:cname="ADDREN" edc:nzwidth="0x1" edc:desc="Address Enable"/>
              <edc:SFRFieldDef edc:cname="ADDRMASK" edc:nzwidth="0x7" edc:desc="Address Mask"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x11" edc:_addr="0x90F"/>
        <edc:SFRDef ltx:memberofperipheral="TWI1" edc:cname="CTRLA" edc:nzwidth="0x8" edc:access="-n-nnnn-" edc:por="00000000" edc:mclr="00000000" edc:impl="0x5E" edc:_addr="0x920">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI1">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="FMPEN" edc:nzwidth="0x1" edc:desc="FM Plus Enable">
                <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Operating in Standard-mode or Fast-mode" edc:when="(field &amp; 0x1) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="ON" edc:desc="Operating in Fast-mode Plus" edc:when="(field &amp; 0x1) == 0x01"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="SDAHOLD" edc:nzwidth="0x2" edc:desc="SDA Hold Time">
                <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="SDA hold time off" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="50NS" edc:desc="Typical 50ns hold time" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="300NS" edc:desc="Typical 300ns hold time" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="500NS" edc:desc="Typical 500ns hold time" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="SDASETUP" edc:nzwidth="0x1" edc:desc="SDA Setup Time">
                <edc:SFRFieldSemantic edc:cname="4CYC" edc:desc="SDA setup time is 4 clock cycles" edc:when="(field &amp; 0x1) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="8CYC" edc:desc="SDA setup time is 8 clock cycles" edc:when="(field &amp; 0x1) == 0x01"/>
              </edc:SFRFieldDef>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="INPUTLVL" edc:nzwidth="0x1" edc:desc="Input Voltage Transition Level">
                <edc:SFRFieldSemantic edc:cname="I2C" edc:desc="I2C input voltage transition level" edc:when="(field &amp; 0x1) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="SMBUS" edc:desc="SMBus 3.0 input voltage transition level" edc:when="(field &amp; 0x1) == 0x01"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
